# Игра «Камень-ножницы-бумага».

# Игра

# Правила:

# Игроки вместе читают вслух «камень... ножницы... бумага... один... два... три», потрясая кулаками. Когда они читают «Три», они одновременно указывают на один из трех знаков: камень, ножницы или бумагу.

# Маркировки показаны на картинке.



# Победитель будет определен по следующим правилам:

#      Бумага побеждает камень («бумага оборачивает камень»)
#      Rock Beats Scissors («Камень тупит или ломает ножницы»)
#      Ножницы бьют бумагу («ножницы режут бумагу»).

# Если игроки показывают одинаковый знак, получается ничья и игра переигрывается.

# Задача:
# Напишите программу, моделирующую игру, в которой участвуют хотя бы человек и робот или два человека.

# После каждого раунда записывайте результаты игры в списки. Записывайте имена игроков и/или их результаты. При необходимости отобразите на экране, кто сколько очков набрал.
# Вы можете перетасовать элементы списка случайным образом, используя функцию shuffle() модуля случайных чисел.
# импортировать случайный
# mylist = ["яблоко", "банан", "вишня"]
# Random.shuffle(мой список)
# распечатать(мой список)
