# Ќаписать программу дл€ проверки знаний по математике.

# ѕредложить пользователю выбрать сложность заданий.
# Ќапример:

#     Tase 1, Tase 2, Tase 3
#     количество действий(+,-,/,*,**)
#     величину случайно генерируемых чисел.


# ¬ программе случайным образом "задаютс€" примеры, с учетом сложности провр€емых знаний.
# ѕосле введенного пользователем ответа, провер€етс€ его правильностью.

# ѕридумать условие выхода из цикла.(можно сначала указать количество примеров)

# ¬ конце работы программы, надо сообщить тестируемому оценку.
# <60% - Hinne 2
# 60-75% - Hinne 3
# 75-90% - Hinne 4
# >90% - Hinne 5
